/*
 Полный вариант (на 4 или 5 в зависимости от сроков)
 Работа состоит из двух программ.
  1.Программа, формирующая файл записей.
    В качестве записей использовать свой вариант
    работы со структурами за 1 курс. Файл должен содержать 8-10 записей.
  2. Программа, обрабатывающая файл записей. Массив не использовать,
    записи из файла считывать по одной и обрабатывать.

 Меню к программе должно включать пункты, реализованные в виде фукнкций:
  а) просмотр файла;
  б) 1-ый пункт задания из работы со структурами;
  в) корректировку одного поля i-ой записи (i ввести).

 Использовать имя файла в качестве параметра командной строки.
*/

#include<stdio.h>
#include<stdlib.h>

int main()
{
   
}
